puztube/app/controllers/chats_controller.rb

  def index
    @chats = Chat.all
---
SELECT * FROM "chats"