puztube/app/controllers/puzzles_controller.rb

SELECT * FROM "puzzles"
---
  def index
    @puzzles = Puzzle.all

SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 2)
SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
SELECT * FROM "chats" WHERE ("chats"."chat_id" = 'PUZ2') ORDER BY created_at DESC LIMIT 10
---
  def show
    @puzzle = Puzzle.find(params[:id])
    @round = Round.find(@puzzle.round_id)
    @chats = Chat.find(:all, :conditions => {:chat_id => @puzzle.chat_id}, :order => "created_at DESC", :limit => 10)

SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 2)
INSERT INTO "chats" ("created_at", "updated_at", "text", "chat_id", "user") VALUES('2011-01-04 19:56:48', '2011-01-04 19:56:48', 'blahblah\\hrmrm''\''', 'PUZ2', 'graft')
---
  def chat
    @puzzle = Puzzle.find(params[:id])
    text = params[:chat_input]
    user = current_user ? current_user.login : "anon"
    channel = @puzzle.chat_id
    if (text =~ /\/([\w]*) /)
      channel = $1
      text.gsub!(/\/[\w]* /,'')
      user = "MAYHEM" if (channel == "all")
    end
    @chat = Chat.new( {
                       :user => user,
                       :text => text,
                       :chat_id => channel
                      } )
    if (@chat.save)

SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 2)
SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
---
  def edit
    @puzzle = Puzzle.find(params[:id])
    @round = Round.find(@puzzle.round_id)

SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 2)
SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
---
  def info
    @puzzle = Puzzle.find(params[:id])
    @round = Round.find(@puzzle.round_id)

SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 2)
UPDATE "puzzles" SET "updated_at" = '2011-01-05 06:29:20', "captain" = 'graft' WHERE "id" = 2
---
  def update
    @puzzle = Puzzle.find(params[:id])

    respond_to do |format|
      if @puzzle.update_attributes(params[:puzzle])

SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 1)
DELETE FROM "puzzles" WHERE "id" = 1
---
  def destroy
    @puzzle = Puzzle.find(params[:id])
    @puzzle.destroy