puztube/app/controllers/rounds_controller.rb

SELECT * FROM "rounds"
---
  def index
    @rounds = Round.all

SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
---
  def show
    @round = Round.find(params[:id])

SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
---
  def new_puzzle
    @round = Round.find(params[:id])

SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
INSERT INTO "puzzles" ("name", "round_id", "created_at", "updated_at", "captain", "url", "meta", "hint", "status", "answer") VALUES('TestPuzzleOne', 1, '2010-12-30 04:36:14', '2010-12-30 04:36:14', NULL, NULL, 'f', '', 'Unsolved', '')
---
  def create_puzzle
    @round = Round.find(params[:id])
    @puzzle = @round.puzzles.build
    @puzzle.name = "New Puzzle"
    @puzzle.status = "New"

    if @puzzle.save

SELECT * FROM "rounds" WHERE ("rounds"."id" = 1)
---
  def edit
    @round = Round.find(params[:id])

INSERT INTO "rounds" ("name", "created_at", "updated_at", "captain", "url", "hint", "answer") VALUES('RoundTestOne', '2010-12-28 22:26:26', '2010-12-28 22:26:26', 0, NULL, '', '')
---
  def create
    @round = Round.new(params[:round])

    respond_to do |format|
      if @round.save

SELECT * FROM "rounds" WHERE ("rounds"."id" = 2)
UPDATE "rounds" SET "updated_at" = '2010-12-29 02:47:00', "captain" = 'graft' WHERE "id" = 2
---
  def update
    @round = Round.find(params[:id])

     if @round.update_attributes(params[:round])

SELECT * FROM "rounds" WHERE ("rounds"."id" = 298486374)
DELETE FROM "rounds" WHERE "id" = 298486374
---
  def destroy
    @round = Round.find(params[:id])

    render :juggernaut => { :type => :send_to_channel, :channel => "ROUNDS" } do |page|
      page << "$('ROUND#{@round.id}').remove();"
    end
    @round.destroy