puztube/app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT * FROM "topics"

  def show
    @topic = Topic.find_by_name(params[:name])
    @chats = Chat.find(:all, :conditions => {:chat_id => @topic.chat_id}, :order => "created_at DESC", :limit => 10)
---
SELECT * FROM "topics" WHERE ("topics"."name" = 'Project Electric Mayhem') LIMIT 1
SELECT * FROM "chats" WHERE ("chats"."chat_id" = 'TOP298486374') ORDER BY created_at DESC LIMIT 10
SELECT * FROM "topics" WHERE ("topics"."id" = 298486374)

  def edit
    @topic = Topic.find_by_name(params[:name])
---
SELECT * FROM "topics" WHERE ("topics"."name" = 'Project Electric Mayhem') LIMIT 1

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("name", "created_at", "updated_at") VALUES('Test', '2011-01-06 21:23:56', '2011-01-06 21:23:56')

  def update
    @topic = Topic.find_by_name(params[:name])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])
---
UPDATE "topics" SET "updated_at" = '2011-01-05 22:58:37', "name" = 'Project Electric Mayhem' WHERE "id" = 298486374

  def destroy
    @topic = Topic.find_by_name(params[:name])
    @topic.destroy
---
SELECT * FROM "topics" WHERE ("topics"."name" = 'MyString') LIMIT 1
DELETE FROM "topics" WHERE "id" = 980190962

  def chat
    @topic = Topic.find(params[:id])
    text = params[:chat_input]
    user = current_user ? current_user.login : "anon"
    channel = @topic.chat_id
    if (text =~ /\/([\w]*) /)
      channel = $1
      text.gsub!(/\/[\w]* /,'')
      user = "MAYHEM" if (channel == "all")
    end
    @chat = Chat.new( {
                       :user => user,
                       :text => text,
                       :chat_id => channel
                      } )
    if (@chat.save)
---
SELECT * FROM "topics" WHERE ("topics"."id" = 298486374)
INSERT INTO "chats" ("created_at", "updated_at", "text", "chat_id", "user") VALUES('2011-01-07 21:05:33', '2011-01-07 21:05:33', 'okay', 'TOP298486374', 'graft')