puztube/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.options = { :sorting => 'priority',:grouped => true }

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '00bcf4ecb6b0ca1a61cf94e7ed43e0a09bc79e0d', '2010-12-28 03:25:05', '4a9de6cb48a6b4cab11f000150f0533a915bc2db', NULL, '2010-12-28 03:25:05', NULL, 'graft', 'faplap@gmail.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 298486374)
UPDATE "users" SET "updated_at" = '2011-01-07 02:18:45', "name" = 'Saurabh Asthana' WHERE "id" = 298486374