puztube/app/controllers/welcome_controller.rb

        def login
          if (params[:user][:login] && user = User.find_by_login(params[:user][:login]))
---
SELECT * FROM "users" WHERE ("users"."login" = 'graft') LIMIT 1