puztube/app/controllers/workspace_controller.rb

  def new
    if (params[:type] == "topic")
      @thread = Topic.find_by_name(params[:name])
    else
      @thread = Puzzle.find(params[:id])
    end
    @workspace = @thread.workspaces.build({:priority=>"Normal"})
    if @workspace.save
---
SELECT * FROM "topics" WHERE ("topics"."name" = 'Project Electric Mayhem') LIMIT 1
SELECT * FROM "puzzles" WHERE ("puzzles"."id" = 2)
SELECT * FROM "topics" WHERE ("topics"."id" = 298486374)
INSERT INTO "workspaces" ("created_at", "updated_at", "thread_type", "thread_id", "content") VALUES('2011-01-07 03:24:39', '2011-01-07 03:24:39', 'Topic', 298486374, NULL)

  def delete
    logger.info "Destroying"
    @workspace = Workspace.find(params[:id])
    Juggernaut.send_to_channel( "$('#{@workspace.div_id}').remove()", @workspace.thread.chat_id )
    @workspace.destroy
---
SELECT * FROM "workspaces" WHERE ("workspaces"."id" = 24)
DELETE FROM "workspaces" WHERE "id" = 24

  def edit
    @workspace = Workspace.find(params[:id])
---
SELECT * FROM "workspaces" WHERE ("workspaces"."id" = 25)

  def update
    @workspace = Workspace.find(params[:id])

    if @workspace.updated_at > Time.at(params[:locktime].to_i)
---
SELECT * FROM "workspaces" WHERE ("workspaces"."id" = 25)
UPDATE "workspaces" SET "updated_at" = '2011-01-07 21:17:39', "content" = 'The standard Lorem Ipsum passage, used since the 1500s